# ImportScaleTooLarge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ImportScaleTooLarge Property
BuiltInFailures..::..ImportFailures Class See Also
---
This scale factor would make the imported object too large. Reverting to the previous scale factor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ImportScaleTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportScaleTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ImportScaleTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace